#+title: Sprint Backlog 00 for Patrick
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) epic(e) }

* Mission Statement

- Create a Football Manager Game

* Stories

Stories you are working on this sprint.

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2018-03-14 Wed 17:21]
| <75>                                                                        |         |       |      |       |
| Headline                                                                    | Time    |       |      |     % |
|-----------------------------------------------------------------------------+---------+-------+------+-------|
| *Total time*                                                                | *27:51* |       |      | 100.0 |
|-----------------------------------------------------------------------------+---------+-------+------+-------|
| Stories                                                                     | 27:51   |       |      | 100.0 |
| Active                                                                      |         | 27:51 |      | 100.0 |
| STARTED Sprint and product backlog grooming                                 |         |       | 3:44 |  13.4 |
| STARTED Discussing task at hand                                             |         |       | 1:37 |   5.8 |
| STARTED Writing next task                                                   |         |       | 0:23 |   1.4 |
| COMPLETED Change variables from team to table                               |         |       | 0:21 |   1.3 |
| COMPLETED Remove commented code in team.cpp/hpp                             |         |       | 0:13 |   0.8 |
| COMPLETED Add new teams and players to epl.data                             |         |       | 0:31 |   1.9 |
| COMPLETED Create user.hpp                                                   |         |       | 0:12 |   0.7 |
| STARTED Clean up files                                                      |         |       | 0:15 |   0.9 |
| COMPLETED Add constructors to user.hpp                                      |         |       | 0:24 |   1.4 |
| COMPLETED Add class to game.hpp                                             |         |       | 0:22 |   1.3 |
| COMPLETED Set next task                                                     |         |       | 0:16 |   1.0 |
| COMPLETED Clean game.cpp/hpp                                                |         |       | 0:29 |   1.7 |
| COMPLETED Add game.cpp                                                      |         |       | 0:18 |   1.1 |
| COMPLETED Add user.cpp                                                      |         |       | 0:12 |   0.7 |
| COMPLETED Clean game and user.hpp/cpp                                       |         |       | 0:44 |   2.6 |
| CANCELLED Look and attempt to fix "quit" bug                                |         |       | 0:12 |   0.7 |
| COMPLETED Study session on Constructors                                     |         |       | 2:04 |   7.4 |
| COMPLETED Review last push                                                  |         |       | 0:08 |   0.5 |
| COMPLETED Make users display from users.cpp                                 |         |       | 1:24 |   5.0 |
| STARTED Veiw MC's comment on commits                                        |         |       | 0:49 |   2.9 |
| COMPLETED Read through engine.cpp                                           |         |       | 0:27 |   1.6 |
| COMPLETED Look at NI's changes                                              |         |       | 0:15 |   0.9 |
| POSTPONED Create display method for match_day                               |         |       | 0:35 |   2.1 |
| COMPLETED Review last Fridays work                                          |         |       | 1:04 |   3.8 |
| STARTED Attempt team management option                                      |         |       | 4:06 |  14.7 |
| STARTED Go through NI's season changes                                      |         |       | 0:34 |   2.0 |
| COMPLETED Rename team to squad                                              |         |       | 3:07 |  11.2 |
| COMPLETED Read through MC's diagram changes                                 |         |       | 1:10 |   4.2 |
| COMPLETED Change team to club in diagram                                    |         |       | 0:22 |   1.3 |
| COMPLETED Create club.cpp/hpp                                               |         |       | 0:21 |   1.3 |
| STARTED Change correct lines in league.cpp                                  |         |       | 1:12 |   4.3 |
#+TBLFM: $5='(org-clock-time% @3$2 $2..$4);%.1f
#+end:


*** STARTED Sprint and product backlog grooming                       :story:
    CLOCK: [2018-03-14 Wed 16:59]--[2018-03-14 Wed 17:21] =>  0:22
    CLOCK: [2018-03-14 Wed 12:48]--[2018-03-14 Wed 13:07] =>  0:19
    CLOCK: [2018-03-13 Tue 14:13]--[2018-03-13 Tue 14:41] =>  0:28
    CLOCK: [2018-03-13 Tue 12:32]--[2018-03-13 Tue 12:49] =>  0:17
    CLOCK: [2018-03-13 Tue 10:23]--[2018-03-13 Tue 10:41] =>  0:18
    CLOCK: [2018-03-12 Mon 17:02]--[2018-03-12 Mon 17:11] =>  0:09
    CLOCK: [2018-03-12 Mon 13:10]--[2018-03-12 Mon 13:26] =>  0:16
    CLOCK: [2018-03-12 Mon 10:28]--[2018-03-12 Mon 10:42] =>  0:14
    CLOCK: [2018-03-09 Fri 16:44]--[2018-03-09 Fri 17:02] =>  0:18
    CLOCK: [2018-03-09 Fri 15:35]--[2018-03-09 Fri 15:59] =>  0:24
    CLOCK: [2018-03-08 Thu 16:42]--[2018-03-08 Thu 16:56] =>  0:14
    CLOCK: [2018-03-08 Thu 13:28]--[2018-03-08 Thu 13:35] =>  0:07
    CLOCK: [2018-03-06 Tue 16:28]--[2018-03-06 Tue 16:39] =>  0:11
    CLOCK: [2018-03-06 Tue 15:54]--[2018-03-06 Tue 15:58] =>  0:04
    CLOCK: [2018-03-06 Tue 14:57]--[2018-03-06 Tue 15:00] =>  0:03

Updates to sprint and product backlog.

*** STARTED Discussing task at hand
    CLOCK: [2018-03-14 Wed 09:49]--[2018-03-14 Wed 09:55] =>  0:06
    CLOCK: [2018-03-13 Tue 11:58]--[2018-03-13 Tue 12:32] =>  0:34
    CLOCK: [2018-03-13 Tue 10:18]--[2018-03-13 Tue 10:23] =>  0:05
    CLOCK: [2018-03-12 Mon 12:21]--[2018-03-12 Mon 12:31] =>  0:10
    CLOCK: [2018-03-12 Mon 11:52]--[2018-03-12 Mon 12:07] =>  0:15
    CLOCK: [2018-03-12 Mon 10:10]--[2018-03-12 Mon 10:18] =>  0:08
    CLOCK: [2018-03-09 Fri 16:02]--[2018-03-09 Fri 16:04] =>  0:02
    CLOCK: [2018-03-09 Fri 11:43]--[2018-03-09 Fri 11:54] =>  0:11
    CLOCK: [2018-03-08 Thu 10:00]--[2018-03-08 Thu 10:06] =>  0:06
*** STARTED Writing next task
    CLOCK: [2018-03-12 Mon 16:39]--[2018-03-12 Mon 17:02] =>  0:23
*** COMPLETED Change variables from team to table
    CLOSED: [2018-03-06 Tue 14:55]
    CLOCK: [2018-03-06 Tue 11:31]--[2018-03-06 Tue 11:52] =>  0:21

- Drop properties from team class
- Drop properties from data file
- Run code to make sure reading still works

*** COMPLETED Remove commented code in team.cpp/hpp
    CLOSED: [2018-03-06 Tue 14:57]
    CLOCK: [2018-03-06 Tue 14:43]--[2018-03-06 Tue 14:56] =>  0:13

*** COMPLETED Add new teams and players to epl.data
    CLOSED: [2018-03-06 Tue 15:55]
    CLOCK: [2018-03-06 Tue 15:35]--[2018-03-06 Tue 15:54] =>  0:19
    CLOCK: [2018-03-06 Tue 15:15]--[2018-03-06 Tue 15:27] =>  0:12

- Link: https://www.premierleague.com/players

- Use link to add all teams in premier league
- Only and one player per team
- And add players position

*** COMPLETED Create user.hpp
    CLOSED: [2018-03-06 Tue 16:56]
    CLOCK: [2018-03-06 Tue 16:43]--[2018-03-06 Tue 16:55] =>  0:12

- Create user.hpp file
- Create class for user
- Add to class:
  - string name
  - string team_name

*** STARTED Clean up files
    CLOCK: [2018-03-07 Wed 09:13]--[2018-03-07 Wed 09:28] =>  0:15

- Remove white-spaces
- Break line that are too long
- Delete any commented out code

*** COMPLETED Add constructors to user.hpp
    CLOSED: [2018-03-07 Wed 10:55]
    CLOCK: [2018-03-07 Wed 09:30]--[2018-03-07 Wed 09:54] =>  0:24

- Read on Constructors:
  - http://www.cplusplus.com/doc/tutorial/classes/

- Default constructor, user();
- One with arguments, user(argument1, argument2);

*** COMPLETED Add class to game.hpp
    CLOSED: [2018-03-07 Wed 11:49]
    CLOCK: [2018-03-07 Wed 11:27]--[2018-03-07 Wed 11:49] =>  0:22

- Reference diagram
- Add to class:
  - vector<user>
  - int current_match_day

*** COMPLETED Set next task
    CLOSED: [2018-03-07 Wed 15:45]
    CLOCK: [2018-03-07 Wed 14:55]--[2018-03-07 Wed 15:11] =>  0:16

*** COMPLETED Clean game.cpp/hpp
    CLOSED: [2018-03-07 Wed 16:22]
    CLOCK: [2018-03-07 Wed 15:14]--[2018-03-07 Wed 15:43] =>  0:29

- Uncomment out correct constructor
- Remove game();
- Change:
  - game_setup(std::vector<user> user, int current_match_day);
- To:
  - game_setup(std::vector<user> users, int current_match_day);
- Make current_match_day private
- Add:
  - std::vector<user> users_;
  - int current_match_day_;

*** COMPLETED Add game.cpp
    CLOSED: [2018-03-07 Wed 16:22]
    CLOCK: [2018-03-07 Wed 15:48]--[2018-03-07 Wed 16:06] =>  0:18
- Connect game.hpp
- Write Function:
  - game::game_setup(std::vector<user> users, int current_match_day)
    : users_(users), current_match_day_(current_match_day)

*** COMPLETED Add user.cpp
    CLOSED: [2018-03-08 Thu 09:29]
    CLOCK: [2018-03-08 Thu 09:17]--[2018-03-08 Thu 09:29] =>  0:12

- Create file
- Write in method and constructor functions

*** COMPLETED Clean game and user.hpp/cpp
    CLOSED: [2018-03-08 Thu 10:16]
    CLOCK: [2018-03-08 Thu 10:06]--[2018-03-08 Thu 10:16] =>  0:10
    CLOCK: [2018-03-08 Thu 09:29]--[2018-03-08 Thu 10:03] =>  0:34


- Correct constructor name
- Fix indentations
*** CANCELLED Look and attempt to fix "quit" bug
    CLOSED: [2018-03-08 Thu 14:13]
    CLOCK: [2018-03-08 Thu 13:35]--[2018-03-08 Thu 13:47] =>  0:12

- In engine.cpp
- look for what happens after:
  - user input "2"
  - then "N"

*** COMPLETED Study session on Constructors
    CLOSED: [2018-03-08 Thu 16:42]
    CLOCK: [2018-03-08 Thu 16:00]--[2018-03-08 Thu 16:42] =>  0:42
    CLOCK: [2018-03-08 Thu 15:16]--[2018-03-08 Thu 15:48] =>  0:32
    CLOCK: [2018-03-08 Thu 14:39]--[2018-03-08 Thu 15:06] =>  0:27
    CLOCK: [2018-03-08 Thu 14:15]--[2018-03-08 Thu 14:38] =>  0:23


- Videos:
  - Buckys C++ Programming Tutorials: https://www.youtube.com/watch?v=_b7odUc7lg0-
  - Constructors and Destructors: https://www.youtube.com/watch?v=095BHgxo_zE

- Written:
  - https://www.geeksforgeeks.org/constructors-c/
  - https://www.tutorialspoint.com/cplusplus/cpp_constructor_destructor.htm
  - http://www.cplusplus.com/doc/tutorial/classes/

- Quizzes:
  - https://www.geeksforgeeks.org/c-plus-plus-gq/constructors-gq/
  - https://www.ooportal.com/building-cplusplus-classes/module4/cplus-constructor-quiz.php
  - https://www.proprofs.com/quiz-school/quizshow.php?title=cc-programming-language-set-2&q=1
**
*** COMPLETED Review last push
    CLOSED: [2018-03-08 Thu 15:16]
    CLOCK: [2018-03-08 Thu 15:08]--[2018-03-08 Thu 15:16] =>  0:08

- Niams push: Fixed table
*** COMPLETED Make users display from users.cpp
    CLOSED: [2018-03-09 Fri 11:57]
    CLOCK: [2018-03-09 Fri 11:54]--[2018-03-09 Fri 11:56] =>  0:02
    CLOCK: [2018-03-09 Fri 11:09]--[2018-03-09 Fri 11:43] =>  0:34
    CLOCK: [2018-03-09 Fri 09:39]--[2018-03-09 Fri 10:27] =>  0:48


- Create:
  - Inside user.hpp
    - void display();
  - Inside user.cpp
    - void user::display(){}

- Try to copy the for loop from engine.cpp
- Paste into user::display()

- Inside engine.cpp
  - Where original for loop was
  - Write:
    - user u;
    - u.display();

- Change u in, user u
  - to: user displayU;
  - Remove this

- Remove for loop from user.cpp
- Re-add for loop to engine.cpp

- Write inside for loop
  - u.display();

*** STARTED Veiw MC's comment on commits
    CLOCK: [2018-03-09 Fri 13:38]--[2018-03-09 Fri 14:12] =>  0:34
    CLOCK: [2018-03-09 Fri 13:29]--[2018-03-09 Fri 13:38] =>  0:09
    CLOCK: [2018-03-09 Fri 13:23]--[2018-03-09 Fri 13:29] =>  0:06

- Remove:
  - commented out code from user.cpp
  - and #include "engine.hpp"

*** COMPLETED Read through engine.cpp
    CLOSED: [2018-03-09 Fri 14:53]
    CLOCK: [2018-03-09 Fri 14:26]--[2018-03-09 Fri 14:53] =>  0:27

- Slowly and methodically
- Read MC's comments
- Attempt to find something that you feel confident changing without help
- Change said thing
*** COMPLETED Look at NI's changes
    CLOSED: [2018-03-09 Fri 15:19]
    CLOCK: [2018-03-09 Fri 15:03]--[2018-03-09 Fri 15:18] =>  0:15

*** POSTPONED Create display method for match_day
    CLOSED: [2018-03-09 Fri 16:44]
    CLOCK: [2018-03-09 Fri 16:18]--[2018-03-09 Fri 16:44] =>  0:26
    CLOCK: [2018-03-09 Fri 16:04]--[2018-03-09 Fri 16:13] =>  0:09

- Similar to task:
  - Make users display from users.cpp

- Inside engine.cpp
  - Find where match is originally being printed
  - If there is no instance of match day, write:
    - match mDisplay;
  - Inside for loop:
    - Cut old contents
    - Write:
      - mDisplay.display()

- Inside match_day.cpp
  - Create display function
  - Paste content of engine.cpp for loop
  - Remove old instance name from variables

*** COMPLETED Review last Fridays work
    CLOSED: [2018-03-12 Mon 10:09]
    CLOCK: [2018-03-12 Mon 09:04]--[2018-03-12 Mon 10:08] =>  1:04

- Go over what work was don last week
- Attempt to make tasks
*** STARTED Attempt team management option
    CLOCK: [2018-03-13 Tue 10:41]--[2018-03-13 Tue 11:16] =>  0:35
    CLOCK: [2018-03-13 Tue 09:48]--[2018-03-13 Tue 10:18] =>  0:30
    CLOCK: [2018-03-13 Tue 09:02]--[2018-03-13 Tue 09:24] =>  0:22
    CLOCK: [2018-03-12 Mon 16:23]--[2018-03-12 Mon 16:39] =>  0:16
    CLOCK: [2018-03-12 Mon 15:40]--[2018-03-12 Mon 16:05] =>  0:25
    CLOCK: [2018-03-12 Mon 14:31]--[2018-03-12 Mon 15:03] =>  0:32
    CLOCK: [2018-03-12 Mon 12:31]--[2018-03-12 Mon 13:10] =>  0:39
    CLOCK: [2018-03-12 Mon 11:13]--[2018-03-12 Mon 11:48] =>  0:35
    CLOCK: [2018-03-12 Mon 10:55]--[2018-03-12 Mon 11:07] =>  0:12

- End result:
  - A Team management option in game menu
  - Select user that want to make changes
  - Displays current 11 players
  - Displays substitutes
  - User types in player in current team
  - Then player they would like to swap with
  - Type "Done" when finished
  - Returns to in game menu

- Done:
  - Locate "In game" menu in engine.cpp
  - Add Team Management option
    - Add as option 2
    - Move quit to option 3

- To do:
  - Create teamManagement.cpp/hpp
  - Make class in hpp
  - Create:
    - Inside teamManagement.hpp
      - void display();
    - Inside teamManagement.cpp
      - void teamManagement::display(){}
  - In engine.cpp, move Team Management option contents
  - To teamManagement.cpp, display()
  - Connect teamManagement.hpp to engine.cpp
  - Add teamManageent to CMakeLists
  - Check if still works

- Issues:
  - Cant access Name and Team
    - Detail:
      - Inside team_management.cpp
      - uTM.display, name and team blank
      - Cant access game_ in engine.cpp
    - Fix?:
      - Attach engine.hpp to team_management.cpp
      - Create instance of engine
      - Add for loop from engine.cpp
        - for (user uTM : game_.users()) {
                uTM.display();
            }
      - Change "game_.users()"
        - To, e.game_.users()
      - Run

*** STARTED Go through NI's season changes
    CLOCK: [2018-03-12 Mon 15:03]--[2018-03-12 Mon 15:23] =>  0:20
    CLOCK: [2018-03-12 Mon 12:07]--[2018-03-12 Mon 12:21] =>  0:14

*** COMPLETED Rename team to squad
    CLOSED: [2018-03-14 Wed 13:22]
    CLOCK: [2018-03-14 Wed 11:37]--[2018-03-14 Wed 12:48] =>  1:11
    CLOCK: [2018-03-14 Wed 09:02]--[2018-03-14 Wed 09:26] =>  0:24
    CLOCK: [2018-03-13 Tue 16:34]--[2018-03-13 Tue 17:01] =>  0:27
    CLOCK: [2018-03-13 Tue 15:58]--[2018-03-13 Tue 16:17] =>  0:19
    CLOCK: [2018-03-13 Tue 14:41]--[2018-03-13 Tue 15:27] =>  0:46

- Change team.cpp/hpp
- To squad.cpp/hpp
- Inside hpp/cpp
  - Change all "team"
  - To "squad"
- Find and references to team in other files
- Do this before creating new team files for team management

*** POSTPONED Create new team.cpp/hpp

- Make similar to squad.cpp/hpp
- Inside hpp:
  - Class
   - Public:
    - team();
    - team(std::vector<player> first_eleven, std::vector<player> substitutes);
    - display();
    - std::vector<player> first_eleven
    - std::vector<player> substitutes
   - Private:
    - std::vector<player> first_eleven_
    - std::vector<player> substitutes_
- Inside cpp:
  - Connect hpp
  - Print first eleven / substitutes

*** POSTPONED Connect new team to engine.cpp

- Under team management option in game menu
- Run team display

*** COMPLETED Read through MC's diagram changes
    CLOSED: [2018-03-14 Wed 11:37]
    CLOCK: [2018-03-14 Wed 11:10]--[2018-03-14 Wed 11:37] =>  0:27
    CLOCK: [2018-03-14 Wed 10:29]--[2018-03-14 Wed 10:50] =>  0:21
    CLOCK: [2018-03-14 Wed 10:03]--[2018-03-14 Wed 10:25] =>  0:22


- Look at new changes to diagram
- Take time to understand its place in the game
- and take into account the minor differences between team and squad

*** COMPLETED Change team to club in diagram
    CLOSED: [2018-03-14 Wed 15:06]
    CLOCK: [2018-03-14 Wed 14:43]--[2018-03-14 Wed 15:05] =>  0:22

*** COMPLETED Create club.cpp/hpp
    CLOSED: [2018-03-14 Wed 15:36]
    CLOCK: [2018-03-14 Wed 15:11]--[2018-03-14 Wed 15:32] =>  0:21


- Club falls under League
- Squad falls under Club

- Inside Class:
  - Public:
    - club();
    - club(std::string name);
  - Private:
    - std::string name_;

*** STARTED Change correct lines in league.cpp
    CLOCK: [2018-03-14 Wed 16:21]--[2018-03-14 Wed 16:59] =>  0:38
    CLOCK: [2018-03-14 Wed 15:32]--[2018-03-14 Wed 16:06] =>  0:34

- Connect club.hpp
- Find correct lines
- Change "squad"
- To "club"

- Issues:
  - Compiler errors
  - Can't find club vectors

** Deprecated
